<?php
/**
 * Created by PhpStorm.
 * User: lulu
 * Date: 2016/5/24
 * Time: 15:26
 */
namespace Lulu\db;

// 声明接口
interface Dbinterface
{


    /*
    |------------------------------------------
    |执行sql
    |select语句返回对象，其余语句返回true / false,
    |------------------------------------------
    */
    public function query($sql);
    /*
    |------------------------------------------
    |执行sql
    |以数组形式返回所有的结果
    |------------------------------------------
    */
    public function getAll($sql);
    /*
    |------------------------------------------
    |执行sql
    |以数组形式返回一行结果集
    |------------------------------------------
    */
    public function getRow($sql);
    /*
    |------------------------------------------
    |执行sql，以数组形式返回一列结果
    |------------------------------------------
    */
    public function getCol($sql);
    /*
    |------------------------------------------
    |执行sql，以数组形式返回两列数据的映射
    |------------------------------------------
    */
    public function getMap($sql);
    /*
    |------------------------------------------
    |执行sql，返回一个结果
    |------------------------------------------
    */
    public function getOne($sql);

    /*
    |------------------------------------------
    |关闭连接
    |------------------------------------------
    */
    public function close();
}


